<?php
return array(
            'ADMIN_EXCEPTION_CODE' => array(
                                                                            // 错误码
                                                                            '0000' => '成功',
                                                                            '0001' => '请求接口地址无效！',
                                                                            '0002' => '用户名不能为空！',
                                                                            '0003' => '密码不能为空！',
                                                                            '0004' => '用户名或密码错误！',
                                                                            '0005' => '账号已禁用，请联系管理员！',
                                                                           ),

);