<?php
/**
 * 用户服务错误码
 * Ucenter
 *
 */
return array(
    'UCENTER_EXCEPTION_CODE' => array(
        /*COMMON*/
        '0001' => '操作人用户ID无效',
        '0002' => '未检测到客户端IP',
        '0003' => '入参验证失败',
        '0004' => '提交处理失败',
        '0005' => '账号未激活',
        '0006' => '账号已禁用',
        '0007' => '账号已销毁',
        '0008' => '账号活动日志写入失败',

        /*活动类错误码*/
        // 注册 (可注册的用户类型：官网)
        '0101' => '用户名称不能为空',
        '0102' => '用户名格式错误',
        '0103' => '用户名已使用',
        '0104' => '手机号不能为空',
        '0105' => '手机号格式错误',
        '0106' => '手机号已使用',
        '0107' => '邮箱不能为空',
        '0108' => '邮箱格式错误',
        '0109' => '邮箱已使用',
        '0110' => '用户类型不能为空',
        '0111' => '用户类型无效',
        '0112' => '密码不能为空',
        '0113' => '密码格式错误',
        '0114' => '手机验证码输入错误',
        '0115' => '日志写入失败',
        '0116' => '账号名、手机号、邮箱不能同时为空',
        // 登录
        '0201' => '用户名不能为空',
        '0202' => '用户不存在',
        '0203' => '手机号不能为空',
        '0204' => '手机号不存在',
        '0205' => '邮箱不能为空',
        '0206' => '邮箱不存在',
        '0207' => '用户类型不能为空',
        '0208' => '用户类型无效',
        '0209' => '密码不能为空',
        '0210' => '手机验证码输入错误',
        '0211' => '用户名或密码错误',
        // 退出
        '0301' => '用户ID无效',
        '0302' => '用户已退出',
        '0303' => '用户类型不能为空',
        '0304' => '用户类型无效',
        // 获取手机验证码
        '0401' => '短信网关错误',
        // 找回密码
        '0701' => '手机号不能为空',
        '0702' => '手机号不存在',
        '0703' => '手机验证码无效',
        '0704' => '新密码不能为空',
        '0705' => '新密码格式错误',
        '0706' => '用户类型不能为空',
        '0707' => '用户类型无效',
        '0708' => '新密码与原始密码重复',
        '0709' => '手机验证码类型无效',
        // 设置密码
        '0801' => '用户ID不能为空',
        '0802' => '用户ID无效',
        '0803' => '原始密码不能为空',
        '0804' => '原始密码错误',
        '0805' => '新密码不能为空',
        '0806' => '新密码格式错误',
        '0807' => '新密码与原始密码重复',
        // 修改资料
        '0901' => '用户ID不能为空',
        '0902' => '用户ID无效',
        '0903' => '邮箱格式错误',
        '0904' => '用户头像上传失败',
        '0905' => '昵称格式错误',
        '0906' => '真实姓名格式错误',
        '0907' => '性别格式错误',
        '0908' => '省份格式错误',
        '0909' => '城市格式错误',
        '0910' => '地址格式错误',
        '0911' => '用户名称不能为空',
        '0912' => '用户名格式错误',
        '0913' => '用户名已使用',
        '0914' => '手机号不能为空',
        '0915' => '手机号格式错误',
        '0916' => '手机号已使用',
        '0917' => '邮箱不能为空',
        '0918' => '邮箱格式错误',
        '0919' => '邮箱已使用',
        '0920' => '身份证格式错误',


        //修改手机号
        '1001' => '用户ID无效',
        '1002' => '手机号不能为空',
        '1003' => '手机号格式错误',
        '1004' => '手机号已使用',
        // 获取用户基础信息
        '1101' => '用户ID为空',
        '1102' => '用户ID无效',
        '1103' => '用户名无效',
        '1104' => '手机号无效',
        '1105' => '用户账号不存在',
        '1106' => '用户类型无效',
        '1107' => '账号名、账号ID不能同时为空',

        /*操作类错误码*/
        // 添加用户 (可添加的用户类型：4s店、车商、员工)
        '5001' => '用户名称不能为空',
        '5002' => '用户名格式错误',
        '5003' => '用户名已使用',
        '5004' => '手机号不能为空',
        '5005' => '手机号格式错误',
        '5006' => '手机号已使用',
        '5007' => '邮箱不能为空',
        '5008' => '邮箱格式错误',
        '5009' => '邮箱已使用',
        '5010' => '用户类型不能为空',
        '5011' => '用户类型格式错误',
        '5012' => '用户类型已使用',
        '5013' => '密码不能为空',
        '5014' => '密码格式错误',
        '5015' => '账号名、手机号、邮箱不能同时为空',
        // 修改用户资料
        '5101' => '用户ID不能为空',
        '5102' => '用户ID无效',
        '5103' => '邮箱格式错误',
        '5104' => '邮箱已使用',
        '5105' => '用户头像上传失败',
        '5106' => '昵称格式错误',
        '5107' => '真实姓名格式错误',
        '5108' => '性别格式错误',
        '5109' => '省份格式错误',
        '5110' => '城市格式错误',
        '5111' => '地址格式错误',
        '5112' => '用户名称不能为空',
        '5113' => '用户名已使用',
        '5114' => '邮箱不能为空',
        '5115' => '邮箱格式错误',
        '5116' => '邮箱已使用',
        '5117' => '手机号不能为空',
        '5118' => '手机号格式错误',
        '5119' => '手机号已使用',
        '5120' => '性别格式错误',
        '5121' => '身份证格式错误',


        // 启用用户
        '5201' => '用户ID无效',
        '5202' => '已激活',
        // 禁用用户
        '5301' => '用户ID无效',
        '5302' => '已禁用',
        // 销毁用户
        '5401' => '用户ID无效',
        '5402' => '已销毁',
        // 重置用户密码
        '5501' => '用户ID无效',
        '5502' => '新密码不能为空',
        '5503' => '新密码格式错误',
    ),
);