<?php
return array(
                'AUCTION_EXCEPTION_CODE' => array(
                                                // 短息资源错误码
                                                '0000' => '成功',
                                                '0001' => '',

                                                // 拍单订阅
                                                '0011' => '账号ID不能为空',
                                                '0012' => '账号ID无效',
                                                '0013' => '拍单号不能为空',
                                                '0014' => '拍单号无效',
                                                '0015' => '拍单订阅类型不能为空',
                                                '0016' => '拍单订阅类型无效',
                                                '0020' => '拍单订阅入库失败',
                                                '0021' => '拍单ID无效',
                                                '0022' => '获取拍单车辆车系信息失败',
                                                '0023' => '获取车商设备信息失败',
                                                '0024' => '拍单订阅分发日志写入失败',

                                                // Jpush推送服务
                                                '0021' => 'jpushID不能为空',
                                                '0022' => '手机号不能为空无效',
                                                '0023' => '消息内容不能为空',
                                                '0024' => 'jpush推送失败',

                                                ),

);