<?php
return array(
        'SMS_EXCEPTION_CODE' => array(
                // 短息资源错误码
                '0000' => '成功',
                '0001' => '短信网关接口实现异常！',
                '0002' => '短信模板类型编号无效！',
                '0003' => '短信模板参数不完整！',
                '0004' => '短信网关配置无效！',
                '0005' => '短信网关请求失败！',
                '0006' => '电话号码无效！',

                '0010' => '获取短信通知任务失败',
                '0011' => '获取短信验证码任务失败',
                '0012' => '短信任务记录日志失败',

                '200074' => '您尚未提交定制信息，请填写信息立刻定制。', //定制信息不存在
                '200075' => '预约定制信息正在处理中，请保持手机畅通，客服人员马上会与您联系。',
                '200076' => '手机号已使用',
                '200077' => '免费加盟信息正在处理中，请保持手机畅通，客服人员马上会与您联系。',
                '200078' => '预约估价信息正在处理中，请保持手机畅通，客服人员马上会与您联系。',

                '0080' => '设备ID不能为空',
                '0081' => '恭喜，验证码发送成功，请查询短信获得验证码。',
                '0082' => '抱歉，验证码发送失败，请点击重新发送验证码。',
                '0083' => '抱歉，验证码格式错误，请输入6位数字的验证码。',
                '0084' => '抱歉，验证码格式错误，请输入6位数字的验证码。',
                '0085' => '请先获取验证码',
                '0086' => '抱歉，验证码输入错误，请查询短信后重新输入验证码。',
                '0087' => '抱歉，验证码已过期，请点击重新发送验证码。',
                '0088' => '抱歉，今日获取验证码次数超过限制，请明日重试。',
                '0089' => '手机验证无效',
                '0090' => '抱歉，获取验证码太频繁，请稍后重试。',
                '0091' => '更新时间不能为空',
                '200092' => '抱歉，注册失败，请尝试重新获取验证码。',
                '200093' => '抱歉，获取验证码失败，请尝试重新获取验证码。',
        ),

);